{"randomize_suggestions": false, "tasks": [{"suggestions": ["none"], "desc": "<h3>Shrink SBOM</h3><p>Validate/verify the components in the SBOM and remove any you consider out of scope. Follow the steps you would typically take in your role to do this.</p><p>Please add any justification to the risk assessment if you removed any components.</p>", "task_no": 1}, {"suggestions": ["none"], "desc": "<h2>Decide which vulnerabilities actually matter for this device</h2><p>Go through the identified vulnerabilities and determine which ones apply using the risk assessment that is in the TEXT EDITOR(?). As you go through the vulnerabilities, feel free to update/change the threat model based on your findings. If you think the threat model is missing any information, please add a note indicating what is needed.</p><p>The list of identified vulnerabilities is not necessarily exhaustive. If you would like to search for other potential vulnerabilities not captured in the feeds being used in this instance of Dependency Track, please use a separate browser tab to find additional information and include the sources you rely on in the risk assessment.</p>", "task_no": 2}, {"suggestions": ["none"], "desc": "<h3> Do a mini risk analysis and label it Controlled or Uncontrolled</h3><p>For the vulnerabilities that you have identified that apply to the device and are in scope of the SBOM, please provide an analysis for each vulnerability within the Dependency Track or with the risk assessment document.</p><p>For each vulnerability, please provide a label if the vulnerability is Controlled or Uncontrolled using the following definition from the FDA:</p><ul><li><strong>Controlled</strong> risk is present when there is sufficiently low (acceptable) residual risk of patient harm due to a device’s particular cybersecurity vulnerability.</li><li><strong>Uncontrolled</strong> risk is present when there is unacceptable residual risk of patient harm due to inadequate compensating controls and risk mitigations.</li></ul>", "task_no": 3}]}